Ezapataq07/STM32_UNAL/LightSpeedMeasurement_1/Core/Src/main.c
}

/* USER CODE BEGIN 4 */

void parseCommands(char *ptrBufferReception){
	/**
	 * La función parseCommands se encarga del control del programa por medio de comandos mediante el USART
	 */
	// Se toma la información del buffer recibido, leyendo el comando y el parámetro ingresado
	sscanf(ptrBufferReception, "%s %u %u %s",  cmd, &firstParameter, &secondParameter, userMsg);
	// Se ejecuta si el comando es "Menu"
	if (strcmp(cmd, "Menu") == 0){
		// Se imprime el Menu de comandos
		writeMsg(&handlerUSART1, "\nHelp Menu CMDS:\n");
		writeMsg(&handlerUSART1, "1)  Menu              -- Print this menu\n");
		writeMsg(&handlerUSART1, "8)  initToF           -- Initialize ToF Sensor\n");
		writeMsg(&handlerUSART1, "2)  StartMeasurement  -- Start Light Speed Measurement\n");
	}
	// Inicializar el Sensor ToF para poder comenzar a medir
	else if (strcmp(cmd, "initToF") == 0){
		writeMsg(&handlerUSART1, "CMD: initToF\n");
		Initial_Boot_VL53L3CX();
	}
	// Se comienza la acción principal del sensor, hacer el mapeo de la superficie 2D
	else if (strcmp(cmd, "StartMeasurement") == 0){
		writeMsg(&handlerUSART1, "CMD: Start\n");
		StaticRanging(firstParameter);
	}
	// Se hacen mediciones de distancia sin movimiento del motor
	else if (strcmp(cmd, "staticRanging") == 0){
		writeMsg(&handlerUSART1, "CMD: staticRanging\n");
		Static(firstParameter);
	}
	else {
		// En caso de que el comando no sea ninguno de los anteriores, se indica por consola que es incorrecto
		writeMsg(&handlerUSART1, "Incorrect Command!!!\n");
	}
}


void getRangingData(void){
	/**
	 * getRangingData se encarga de mostrar los datos de la medición por consola
	 */
	writeMsg(&handlerUSART1, "Angle(degrees)       Distance(mm)\n");
	for (uint16_t k = 0; k < SIZE_RANGING_DATA; k++){
		sprintf(bufferData, "%5f       %5f\n", angleData[k], rangingData[k]);
		writeMsg(&handlerUSART1, bufferData);
	}
}

void StaticRanging(unsigned int numData){
	/**
	 * StaticRanging hace numData mediciones con el sensor ToF
	 */
	for(uint8_t i = 0; i<11; i++){
		counterRangigData = 0;
		RangingMeasurment();
		SendUltraPulse();
		while (flag == 0){
		}
		distances[i] = distance;
		flag = 0;
		times[i] = (float) rangingData[0] * 3.335640952;
		sprintf(bufferData, "Time = %f ps    Distance= %f cm\n",times[i], distances[i]);
		send_uart2(bufferData);
		HAL_Delay(3000);
	}
	writeMsg(&handlerUSART1, "The Static Ranging has finished\n");
	getLightSpeed(times, distances);

}

void RangingMeasurment(void){
	/**
	 * RangingMeasurment se encarga de hacer una medición con el sensor ToF y guardarla en un arreglo, realmente hace 5 mediciones y toma el
	 * promedio. Está configurada para que no guarde medidas en caso de que sean erróneas, y que tome medidas solo cuando detecte un objeto
	 */
	int numObjects = 0;
	VL53LX_MultiRangingData_t MultiRangingData;
	VL53LX_MultiRangingData_t *pMultiRangingData = &MultiRangingData;
	uint8_t NewDataReady=0;
	uint8_t i = 0;
	HAL_Delay(2);
	if(status){
		writeMsg(&handlerUSART1, "VL53LX_StartMeasurement failed\n");
		while(1);
	}
	if (isInterrupt){
	do // HW interrupt mode
	{
	  __WFI();
	  if(IntCount !=0 ){
		IntCount=0;
		status = VL53LX_GetMultiRangingData(Dev, pMultiRangingData);
		numObjects = pMultiRangingData->NumberOfObjectsFound;
		RangeStatus = pMultiRangingData->RangeData->RangeStatus;
		// Control de errores, si se detecta un error se muestra por consola cúal es y se reinicia la medición
		// En caso de que hayan muchos errores se manda por consola un mensaje de error general
		if (RangeStatus){
			if (numMeasurmentErrors >= 3){
				writeMsg(&handlerUSART1, "The Tof Sensor is Failing, probably for the above reasons.\n");
			}
			RangeErrorsMsg(RangeStatus);
			numMeasurmentErrors++;
			HAL_Delay(250);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		// Control de múltiples objetos, si se detecta más de un objeto se reinicia la medición
		// En caso de que se detecte varias veces la presencia de más de un objeto se manda el mensaje por consola
		if (numObjects > 1){
			if (errorMultipleObjects >= 3){
				writeMsg(&handlerUSART1, "There are multiple objects to range. There must only be one.\n");
			}
			errorMultipleObjects++;
			HAL_Delay(250);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		meanRangingData += (float) pMultiRangingData->RangeData[0].RangeMilliMeter;
		i++;
		if (status==0){
		  status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
		}

	  }
	}
	while(i < 5);
	}
	else{
	do{ // polling mode
	  status = VL53LX_GetMeasurementDataReady(Dev, &NewDataReady);
	  HAL_Delay(2); // 1 ms polling period, could be longer.
	  if((!status)&&(NewDataReady!=0)){
		status = VL53LX_GetMultiRangingData(Dev, pMultiRangingData);
		RangeStatus = pMultiRangingData->RangeData->RangeStatus;
		if (RangeStatus){
			if (numMeasurmentErrors >= 10){
				printf("%s\n", "The Tof Sensor is Failing");
			}
			RangeErrors[numMeasurmentErrors] = RangeStatus;
			numMeasurmentErrors++;
			pMultiRangingData->RangeData[0].RangeMilliMeter = 0;
			HAL_Delay(500);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		printf("%5d", pMultiRangingData->RangeData[0].RangeMilliMeter);
		i++;
		numMeasurmentErrors = 0;
		printf ("\n");
		if (status==0){
		  status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
		}
	  }
	}
	while (i < 1);
	}
	rangingData[counterRangigData] = meanRangingData/5.0;
	counterRangigData++;
	numMeasurmentErrors = 0;
	errorMultipleObjects = 0;
	meanRangingData = 0;
}

void initSystem(void){
	// Se configura el SysTick
	config_SysTickMs();

	/* Configuración del State LED */
	handlerStateLED.pGPIOx 								= GPIOC;
	handlerStateLED.GPIO_PinConfig.GPIO_PinNumber		= PIN_6;
	handlerStateLED.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;		// Se configura el PIN en modo OUTPUT
	handlerStateLED.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;	// Se define el OUTPUT TYPE como Push-Pull, para poder hacer el blinky
	handlerStateLED.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;	// Se configura el OUTPUT con una velocidad MEDIUM
	// Se carga la configuración del State LED
	GPIO_Config(&handlerStateLED);



	/* Configuración para el suicheo del Sensor */
	VL53L3CX_VDD.pGPIOx = GPIOB;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinNumber = PIN_13;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinOPType = GPIO_OTYPE_PUSHPULL;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPDR_NOTHING;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinSpeed = GPIO_OSPEED_HIGH;
	// Se carga la configuración y se inicia con el sensor apagado
	GPIO_Config(&VL53L3CX_VDD);
	GPIO_WritePin(&VL53L3CX_VDD, 0);

	/* Configuración del Timer2, que controla el blinky del StateLED */
	handlerStateLedTimer.ptrTIMx					= TIM2;
	handlerStateLedTimer.timerConfig.Timer_mode		= TIMER_MODE_UP;
	handlerStateLedTimer.timerConfig.Timer_speed	= TIMER_INCR_SPEED_100us;
	handlerStateLedTimer.timerConfig.Timer_period	= 2500;
	// Se carga la configuración del Timer2
	BTimer_Config(&handlerStateLedTimer);

