Ezapataq07/STM32_UNAL/LightSpeedMeasurement_1/Core/Src/main.c
void Exti10_Falling_Callback(void){
	timeTravel = htim5.Instance->CNT-timeStamp;
	getDistance(timeTravel);
	__HAL_TIM_SET_COUNTER(&htim5, 0);
}


void SendUltraPulse(void){
	Delay_us(5);
	HAL_GPIO_WritePin(TRIG_GPIO_Port, TRIG_Pin, 1);
	Delay_us(10);
	HAL_GPIO_WritePin(TRIG_GPIO_Port, TRIG_Pin, 0);
}

void Delay_us(uint16_t us){
	__HAL_TIM_SET_COUNTER(&htim5, 0);
	while (__HAL_TIM_GET_COUNTER(&htim5) < us);
}


void getDistance(uint32_t time){
	distance = (double) time / 58.0;
	if (distance < 2.0 || distance > 300.0){
		SendUltraPulse();
	} else{
		flag = 1;
	}
//	sprintf(bufferData, "Distance = %f cm\n", distance);
//	send_uart2(bufferData);
}

void getLightSpeed(double* times, double* distances){
	double lightSpeed = 0;
	double sumaX = 0;
	double sumaY = 0;
	double sumaX2 = 0;
	double sumaXY = 0;
	//Sumas
	for (uint8_t i = 1; i<11; i++){
		sumaX += times[i];
		sumaY += distances[i];
		sumaX2 += times[i]*times[i];
		sumaXY += times[i]*distances[i];
	}

	lightSpeed = (((10.0*sumaXY)-(sumaX*sumaY))*10000000000.0)/((10.0*sumaX2)-(sumaX*sumaX));
	sprintf(bufferData, "The Measured Speed of Light is %lf km/s\n", lightSpeed);
	send_uart2(bufferData);
}

void Static(unsigned int numData){
	/**
	 * StaticRanging hace numData mediciones con el sensor ToF
	 */
	while (numData > 0){
		counterRangigData = 0;
		RangingMeasurment();
		sprintf(bufferData, "Distance = %f mm\n",rangingData[0]);
		writeMsg(&handlerUSART1, bufferData);
		numData--;
		HAL_Delay(10);
	}
	writeMsg(&handlerUSART1, "The Static Ranging has finished\n");
	getLightSpeed(times, distances);
}


void send_uart2 (char *string)
{
	uint16_t len = strlen (string);
	HAL_UART_Transmit(&huart2, (uint8_t *) string, len, HAL_MAX_DELAY);  // transmit in blocking mode
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
